Sequential
======================================================================
Layer (type)         Output Shape         Param #    Trainable 
======================================================================
Conv2d               [64, 14, 14]         9,408      False     
______________________________________________________________________
BatchNorm2d          [64, 14, 14]         128        True      
______________________________________________________________________
ReLU                 [64, 14, 14]         0          False     
______________________________________________________________________
MaxPool2d            [64, 7, 7]           0          False     
______________________________________________________________________
Conv2d               [64, 7, 7]           36,864     False     
______________________________________________________________________
BatchNorm2d          [64, 7, 7]           128        True      
______________________________________________________________________
ReLU                 [64, 7, 7]           0          False     
______________________________________________________________________
Conv2d               [64, 7, 7]           36,864     False     
______________________________________________________________________
BatchNorm2d          [64, 7, 7]           128        True      
______________________________________________________________________
Conv2d               [64, 7, 7]           36,864     False     
______________________________________________________________________
BatchNorm2d          [64, 7, 7]           128        True      
______________________________________________________________________
ReLU                 [64, 7, 7]           0          False     
______________________________________________________________________
Conv2d               [64, 7, 7]           36,864     False     
______________________________________________________________________
BatchNorm2d          [64, 7, 7]           128        True      
______________________________________________________________________
Conv2d               [128, 4, 4]          73,728     False     
______________________________________________________________________
BatchNorm2d          [128, 4, 4]          256        True      
______________________________________________________________________
ReLU                 [128, 4, 4]          0          False     
______________________________________________________________________
Conv2d               [128, 4, 4]          147,456    False     
______________________________________________________________________
BatchNorm2d          [128, 4, 4]          256        True      
______________________________________________________________________
Conv2d               [128, 4, 4]          8,192      False     
______________________________________________________________________
BatchNorm2d          [128, 4, 4]          256        True      
______________________________________________________________________
Conv2d               [128, 4, 4]          147,456    False     
______________________________________________________________________
BatchNorm2d          [128, 4, 4]          256        True      
______________________________________________________________________
ReLU                 [128, 4, 4]          0          False     
______________________________________________________________________
Conv2d               [128, 4, 4]          147,456    False     
______________________________________________________________________
BatchNorm2d          [128, 4, 4]          256        True      
______________________________________________________________________
Conv2d               [256, 2, 2]          294,912    False     
______________________________________________________________________
BatchNorm2d          [256, 2, 2]          512        True      
______________________________________________________________________
ReLU                 [256, 2, 2]          0          False     
______________________________________________________________________
Conv2d               [256, 2, 2]          589,824    False     
______________________________________________________________________
BatchNorm2d          [256, 2, 2]          512        True      
______________________________________________________________________
Conv2d               [256, 2, 2]          32,768     False     
______________________________________________________________________
BatchNorm2d          [256, 2, 2]          512        True      
______________________________________________________________________
Conv2d               [256, 2, 2]          589,824    False     
______________________________________________________________________
BatchNorm2d          [256, 2, 2]          512        True      
______________________________________________________________________
ReLU                 [256, 2, 2]          0          False     
______________________________________________________________________
Conv2d               [256, 2, 2]          589,824    False     
______________________________________________________________________
BatchNorm2d          [256, 2, 2]          512        True      
______________________________________________________________________
Conv2d               [512, 1, 1]          1,179,648  False     
______________________________________________________________________
BatchNorm2d          [512, 1, 1]          1,024      True      
______________________________________________________________________
ReLU                 [512, 1, 1]          0          False     
______________________________________________________________________
Conv2d               [512, 1, 1]          2,359,296  False     
______________________________________________________________________
BatchNorm2d          [512, 1, 1]          1,024      True      
______________________________________________________________________
Conv2d               [512, 1, 1]          131,072    False     
______________________________________________________________________
BatchNorm2d          [512, 1, 1]          1,024      True      
______________________________________________________________________
Conv2d               [512, 1, 1]          2,359,296  False     
______________________________________________________________________
BatchNorm2d          [512, 1, 1]          1,024      True      
______________________________________________________________________
ReLU                 [512, 1, 1]          0          False     
______________________________________________________________________
Conv2d               [512, 1, 1]          2,359,296  False     
______________________________________________________________________
BatchNorm2d          [512, 1, 1]          1,024      True      
______________________________________________________________________
AdaptiveAvgPool2d    [512, 1, 1]          0          False     
______________________________________________________________________
AdaptiveMaxPool2d    [512, 1, 1]          0          False     
______________________________________________________________________
Flatten              [1024]               0          False     
______________________________________________________________________
BatchNorm1d          [1024]               2,048      True      
______________________________________________________________________
Dropout              [1024]               0          False     
______________________________________________________________________
Linear               [512]                524,800    True      
______________________________________________________________________
ReLU                 [512]                0          False     
______________________________________________________________________
BatchNorm1d          [512]                1,024      True      
______________________________________________________________________
Dropout              [512]                0          False     
______________________________________________________________________
Linear               [2]                  1,026      True      
______________________________________________________________________

Total params: 11,705,410
Total trainable params: 538,498
Total non-trainable params: 11,166,912
Optimized with 'torch.optim.adam.Adam', betas=(0.9, 0.99)
Using true weight decay as discussed in https://www.fast.ai/2018/07/02/adam-weight-decay/ 
Loss function : FlattenedLoss
======================================================================
Callbacks functions applied 